 read_verilog -sv /home/meetowl/uni/project/cores/steel-core-mine/steel_core.v
#read_verilog -sv /home/meetowl/uni/project/cores/steel-core-original/steel_core.v 
proc; opt
memory; opt
techmap; opt
#synth_intel_alm -family cyclonev -top integer_file 
synth -top integer_file 
stat