read_verilog -sv /home/meetowl/uni/project/cores/steel-core-mine/steel_core.v 
proc; opt
memory; opt
techmap; opt
synth_intel -top integer_file
stat