read_verilog -sv /home/meetowl/uni/project/cores/steel-core-mine/steel_core.v
#read_verilog -sv /home/meetowl/uni/project/cores/steel-core-original/steel_core.v 
proc; opt
memory; opt
techmap; opt
synth -top steel_core_top
stat